HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxDsadc_bf.h
/** \\brief  Mask for Ifx_DSADC_CH_IWCTR_Bits.INTEN */
#define IFX_DSADC_CH_IWCTR_INTEN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_IWCTR_Bits.INTEN */
#define IFX_DSADC_CH_IWCTR_INTEN_OFF (7)

/** \\brief  Length for Ifx_DSADC_CH_IWCTR_Bits.IWS */
#define IFX_DSADC_CH_IWCTR_IWS_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_IWCTR_Bits.IWS */
#define IFX_DSADC_CH_IWCTR_IWS_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_IWCTR_Bits.IWS */
#define IFX_DSADC_CH_IWCTR_IWS_OFF (23)

/** \\brief  Length for Ifx_DSADC_CH_IWCTR_Bits.NVALCNT */
#define IFX_DSADC_CH_IWCTR_NVALCNT_LEN (6)

/** \\brief  Mask for Ifx_DSADC_CH_IWCTR_Bits.NVALCNT */
#define IFX_DSADC_CH_IWCTR_NVALCNT_MSK (0x3f)

/** \\brief  Offset for Ifx_DSADC_CH_IWCTR_Bits.NVALCNT */
#define IFX_DSADC_CH_IWCTR_NVALCNT_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_IWCTR_Bits.NVALDIS */
#define IFX_DSADC_CH_IWCTR_NVALDIS_LEN (6)

/** \\brief  Mask for Ifx_DSADC_CH_IWCTR_Bits.NVALDIS */
#define IFX_DSADC_CH_IWCTR_NVALDIS_MSK (0x3f)

/** \\brief  Offset for Ifx_DSADC_CH_IWCTR_Bits.NVALDIS */
#define IFX_DSADC_CH_IWCTR_NVALDIS_OFF (16)

/** \\brief  Length for Ifx_DSADC_CH_IWCTR_Bits.NVALINT */
#define IFX_DSADC_CH_IWCTR_NVALINT_LEN (6)

/** \\brief  Mask for Ifx_DSADC_CH_IWCTR_Bits.NVALINT */
#define IFX_DSADC_CH_IWCTR_NVALINT_MSK (0x3f)

/** \\brief  Offset for Ifx_DSADC_CH_IWCTR_Bits.NVALINT */
#define IFX_DSADC_CH_IWCTR_NVALINT_OFF (24)

/** \\brief  Length for Ifx_DSADC_CH_IWCTR_Bits.REPCNT */
#define IFX_DSADC_CH_IWCTR_REPCNT_LEN (4)

/** \\brief  Mask for Ifx_DSADC_CH_IWCTR_Bits.REPCNT */
#define IFX_DSADC_CH_IWCTR_REPCNT_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_CH_IWCTR_Bits.REPCNT */
#define IFX_DSADC_CH_IWCTR_REPCNT_OFF (8)

/** \\brief  Length for Ifx_DSADC_CH_IWCTR_Bits.REPVAL */
#define IFX_DSADC_CH_IWCTR_REPVAL_LEN (4)

/** \\brief  Mask for Ifx_DSADC_CH_IWCTR_Bits.REPVAL */
#define IFX_DSADC_CH_IWCTR_REPVAL_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_CH_IWCTR_Bits.REPVAL */
#define IFX_DSADC_CH_IWCTR_REPVAL_OFF (12)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.APC */
#define IFX_DSADC_CH_MODCFG_APC_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.APC */
#define IFX_DSADC_CH_MODCFG_APC_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.APC */
#define IFX_DSADC_CH_MODCFG_APC_OFF (29)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.CMVS */
#define IFX_DSADC_CH_MODCFG_CMVS_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.CMVS */
#define IFX_DSADC_CH_MODCFG_CMVS_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.CMVS */
#define IFX_DSADC_CH_MODCFG_CMVS_OFF (24)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.DIVM */
#define IFX_DSADC_CH_MODCFG_DIVM_LEN (4)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.DIVM */
#define IFX_DSADC_CH_MODCFG_DIVM_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.DIVM */
#define IFX_DSADC_CH_MODCFG_DIVM_OFF (16)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.DWC */
#define IFX_DSADC_CH_MODCFG_DWC_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.DWC */
#define IFX_DSADC_CH_MODCFG_DWC_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.DWC */
#define IFX_DSADC_CH_MODCFG_DWC_OFF (23)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.GAINSEL */
#define IFX_DSADC_CH_MODCFG_GAINSEL_LEN (4)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.GAINSEL */
#define IFX_DSADC_CH_MODCFG_GAINSEL_MSK (0xf)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.GAINSEL */
#define IFX_DSADC_CH_MODCFG_GAINSEL_OFF (4)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.GCEN */
#define IFX_DSADC_CH_MODCFG_GCEN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.GCEN */
#define IFX_DSADC_CH_MODCFG_GCEN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.GCEN */
#define IFX_DSADC_CH_MODCFG_GCEN_OFF (28)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.INCFGN */
#define IFX_DSADC_CH_MODCFG_INCFGN_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.INCFGN */
#define IFX_DSADC_CH_MODCFG_INCFGN_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.INCFGN */
#define IFX_DSADC_CH_MODCFG_INCFGN_OFF (2)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.INCFGP */
#define IFX_DSADC_CH_MODCFG_INCFGP_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.INCFGP */
#define IFX_DSADC_CH_MODCFG_INCFGP_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.INCFGP */
#define IFX_DSADC_CH_MODCFG_INCFGP_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.INCWC */
#define IFX_DSADC_CH_MODCFG_INCWC_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.INCWC */
#define IFX_DSADC_CH_MODCFG_INCWC_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.INCWC */
#define IFX_DSADC_CH_MODCFG_INCWC_OFF (15)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.INMAC */
#define IFX_DSADC_CH_MODCFG_INMAC_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.INMAC */
#define IFX_DSADC_CH_MODCFG_INMAC_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.INMAC */
#define IFX_DSADC_CH_MODCFG_INMAC_OFF (14)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.INMODE */
#define IFX_DSADC_CH_MODCFG_INMODE_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.INMODE */
#define IFX_DSADC_CH_MODCFG_INMODE_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.INMODE */
#define IFX_DSADC_CH_MODCFG_INMODE_OFF (12)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.INMUX */
#define IFX_DSADC_CH_MODCFG_INMUX_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.INMUX */
#define IFX_DSADC_CH_MODCFG_INMUX_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.INMUX */
#define IFX_DSADC_CH_MODCFG_INMUX_OFF (10)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.INSEL */
#define IFX_DSADC_CH_MODCFG_INSEL_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.INSEL */
#define IFX_DSADC_CH_MODCFG_INSEL_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.INSEL */
#define IFX_DSADC_CH_MODCFG_INSEL_OFF (8)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.MCFG */
#define IFX_DSADC_CH_MODCFG_MCFG_LEN (2)

