HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxDsadc_bf.h
/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.MCFG */
#define IFX_DSADC_CH_MODCFG_MCFG_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.MCFG */
#define IFX_DSADC_CH_MODCFG_MCFG_OFF (26)

/** \\brief  Length for Ifx_DSADC_CH_MODCFG_Bits.MWC */
#define IFX_DSADC_CH_MODCFG_MWC_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_MODCFG_Bits.MWC */
#define IFX_DSADC_CH_MODCFG_MWC_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_MODCFG_Bits.MWC */
#define IFX_DSADC_CH_MODCFG_MWC_OFF (31)

/** \\brief  Length for Ifx_DSADC_CH_OFFM_Bits.OFFSET */
#define IFX_DSADC_CH_OFFM_OFFSET_LEN (16)

/** \\brief  Mask for Ifx_DSADC_CH_OFFM_Bits.OFFSET */
#define IFX_DSADC_CH_OFFM_OFFSET_MSK (0xffff)

/** \\brief  Offset for Ifx_DSADC_CH_OFFM_Bits.OFFSET */
#define IFX_DSADC_CH_OFFM_OFFSET_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_RECTCFG_Bits.RFEN */
#define IFX_DSADC_CH_RECTCFG_RFEN_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_RECTCFG_Bits.RFEN */
#define IFX_DSADC_CH_RECTCFG_RFEN_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_RECTCFG_Bits.RFEN */
#define IFX_DSADC_CH_RECTCFG_RFEN_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_RECTCFG_Bits.SDCVAL */
#define IFX_DSADC_CH_RECTCFG_SDCVAL_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_RECTCFG_Bits.SDCVAL */
#define IFX_DSADC_CH_RECTCFG_SDCVAL_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_RECTCFG_Bits.SDCVAL */
#define IFX_DSADC_CH_RECTCFG_SDCVAL_OFF (15)

/** \\brief  Length for Ifx_DSADC_CH_RECTCFG_Bits.SGNCS */
#define IFX_DSADC_CH_RECTCFG_SGNCS_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_RECTCFG_Bits.SGNCS */
#define IFX_DSADC_CH_RECTCFG_SGNCS_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_RECTCFG_Bits.SGNCS */
#define IFX_DSADC_CH_RECTCFG_SGNCS_OFF (30)

/** \\brief  Length for Ifx_DSADC_CH_RECTCFG_Bits.SGND */
#define IFX_DSADC_CH_RECTCFG_SGND_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_RECTCFG_Bits.SGND */
#define IFX_DSADC_CH_RECTCFG_SGND_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_RECTCFG_Bits.SGND */
#define IFX_DSADC_CH_RECTCFG_SGND_OFF (31)

/** \\brief  Length for Ifx_DSADC_CH_RECTCFG_Bits.SSRC */
#define IFX_DSADC_CH_RECTCFG_SSRC_LEN (2)

/** \\brief  Mask for Ifx_DSADC_CH_RECTCFG_Bits.SSRC */
#define IFX_DSADC_CH_RECTCFG_SSRC_MSK (0x3)

/** \\brief  Offset for Ifx_DSADC_CH_RECTCFG_Bits.SSRC */
#define IFX_DSADC_CH_RECTCFG_SSRC_OFF (4)

/** \\brief  Length for Ifx_DSADC_CH_RESA_Bits.RESULT */
#define IFX_DSADC_CH_RESA_RESULT_LEN (16)

/** \\brief  Mask for Ifx_DSADC_CH_RESA_Bits.RESULT */
#define IFX_DSADC_CH_RESA_RESULT_MSK (0xffff)

/** \\brief  Offset for Ifx_DSADC_CH_RESA_Bits.RESULT */
#define IFX_DSADC_CH_RESA_RESULT_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_RESM_Bits.RESULT */
#define IFX_DSADC_CH_RESM_RESULT_LEN (16)

/** \\brief  Mask for Ifx_DSADC_CH_RESM_Bits.RESULT */
#define IFX_DSADC_CH_RESM_RESULT_MSK (0xffff)

/** \\brief  Offset for Ifx_DSADC_CH_RESM_Bits.RESULT */
#define IFX_DSADC_CH_RESM_RESULT_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_TSTMP_Bits.CFMDCNT */
#define IFX_DSADC_CH_TSTMP_CFMDCNT_LEN (8)

/** \\brief  Mask for Ifx_DSADC_CH_TSTMP_Bits.CFMDCNT */
#define IFX_DSADC_CH_TSTMP_CFMDCNT_MSK (0xff)

/** \\brief  Offset for Ifx_DSADC_CH_TSTMP_Bits.CFMDCNT */
#define IFX_DSADC_CH_TSTMP_CFMDCNT_OFF (16)

/** \\brief  Length for Ifx_DSADC_CH_TSTMP_Bits.NVALCNT */
#define IFX_DSADC_CH_TSTMP_NVALCNT_LEN (6)

/** \\brief  Mask for Ifx_DSADC_CH_TSTMP_Bits.NVALCNT */
#define IFX_DSADC_CH_TSTMP_NVALCNT_MSK (0x3f)

/** \\brief  Offset for Ifx_DSADC_CH_TSTMP_Bits.NVALCNT */
#define IFX_DSADC_CH_TSTMP_NVALCNT_OFF (24)

/** \\brief  Length for Ifx_DSADC_CH_TSTMP_Bits.RESULT */
#define IFX_DSADC_CH_TSTMP_RESULT_LEN (16)

/** \\brief  Mask for Ifx_DSADC_CH_TSTMP_Bits.RESULT */
#define IFX_DSADC_CH_TSTMP_RESULT_MSK (0xffff)

/** \\brief  Offset for Ifx_DSADC_CH_TSTMP_Bits.RESULT */
#define IFX_DSADC_CH_TSTMP_RESULT_OFF (0)

/** \\brief  Length for Ifx_DSADC_CH_TSTMP_Bits.TSSR */
#define IFX_DSADC_CH_TSTMP_TSSR_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_TSTMP_Bits.TSSR */
#define IFX_DSADC_CH_TSTMP_TSSR_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_TSTMP_Bits.TSSR */
#define IFX_DSADC_CH_TSTMP_TSSR_OFF (31)

/** \\brief  Length for Ifx_DSADC_CH_TSTMP_Bits.TSVAL */
#define IFX_DSADC_CH_TSTMP_TSVAL_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CH_TSTMP_Bits.TSVAL */
#define IFX_DSADC_CH_TSTMP_TSVAL_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CH_TSTMP_Bits.TSVAL */
#define IFX_DSADC_CH_TSTMP_TSVAL_OFF (30)

/** \\brief  Length for Ifx_DSADC_CLC_Bits.DISR */
#define IFX_DSADC_CLC_DISR_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CLC_Bits.DISR */
#define IFX_DSADC_CLC_DISR_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CLC_Bits.DISR */
#define IFX_DSADC_CLC_DISR_OFF (0)

/** \\brief  Length for Ifx_DSADC_CLC_Bits.DISS */
#define IFX_DSADC_CLC_DISS_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CLC_Bits.DISS */
#define IFX_DSADC_CLC_DISS_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CLC_Bits.DISS */
#define IFX_DSADC_CLC_DISS_OFF (1)

/** \\brief  Length for Ifx_DSADC_CLC_Bits.EDIS */
#define IFX_DSADC_CLC_EDIS_LEN (1)

/** \\brief  Mask for Ifx_DSADC_CLC_Bits.EDIS */
#define IFX_DSADC_CLC_EDIS_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_CLC_Bits.EDIS */
#define IFX_DSADC_CLC_EDIS_OFF (3)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.ALEV0 */
#define IFX_DSADC_EVFLAG_ALEV0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.ALEV0 */
#define IFX_DSADC_EVFLAG_ALEV0_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.ALEV0 */
#define IFX_DSADC_EVFLAG_ALEV0_OFF (16)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.ALEV2 */
#define IFX_DSADC_EVFLAG_ALEV2_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.ALEV2 */
#define IFX_DSADC_EVFLAG_ALEV2_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.ALEV2 */
#define IFX_DSADC_EVFLAG_ALEV2_OFF (18)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.ALEV3 */
#define IFX_DSADC_EVFLAG_ALEV3_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.ALEV3 */
#define IFX_DSADC_EVFLAG_ALEV3_MSK (0x1)

/** \\brief  Offset for Ifx_DSADC_EVFLAG_Bits.ALEV3 */
#define IFX_DSADC_EVFLAG_ALEV3_OFF (19)

/** \\brief  Length for Ifx_DSADC_EVFLAG_Bits.RESEV0 */
#define IFX_DSADC_EVFLAG_RESEV0_LEN (1)

/** \\brief  Mask for Ifx_DSADC_EVFLAG_Bits.RESEV0 */
#define IFX_DSADC_EVFLAG_RESEV0_MSK (0x1)

